// Напишите программу, которая в последовательности
// натуральных чисел определяет максимальное
// число, кратное 5. Программа получает
// на вход количество чисел в последовательности,
// а затем сами числа. В последовательности всегда
// имеется число, кратное 5. Количество чисел
// не превышает 1000. Введённые числа
// не превышают 30 000. Программа должна вывести
// одно число — максимальное число, кратное 5.

// Входные данные
// 3
// 10
// 25
// 12

// Выходные данные
// 25

def int m
def int n
in n 

def int i
def int a
0
set a 
0
set i
0
set m

loop
    i > n - 1
    if
        break
    else
    endif
    in a
    a > m
    if
        get a
        set m
    else
    endif
    i + 1
    set i
endloop

get m
out
